#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_dev.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=157c5fc1-4957-4134-855a-e94e8d60f2d8]
module.keycloak_dev.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=9324b99a-fbf3-473d-b34d-e56d786848aa]
module.keycloak_dev.module.onestopauth.module.client_test-project-1260.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=5b249681-e9d3-45da-9c5c-7a26344bd2e9]
module.keycloak_dev.module.onestopauth.module.client_test-project-1260.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=6559f40b-de9f-4e0f-b17e-0906b7e8a59c]
module.keycloak_dev.module.onestopauth.module.client_test-project-1260.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=b77524bf-68df-4f6c-aee4-985191bc1845]
module.keycloak_dev.module.onestopauth.module.client_test-project-1260.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=654845a7-6c0f-4f35-a6e2-3e294f950796]
module.keycloak_dev.module.onestopauth.module.client_test-project-1260.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=76d86a6b-d6bb-49d6-a1f9-6feb760834b2]
module.keycloak_dev.module.onestopauth.module.client_test-project-1260.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f4a1b87b-821d-4f4c-a172-a2bc86c2c47f]
module.keycloak_dev.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=56796eb1-3243-413d-9626-254d74182785]
module.keycloak_dev.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=e7844f14-f7d9-41b0-bc40-804a8eb78e51]
module.keycloak_dev.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=2b936ef8-5b9c-4301-a9bb-bdd575827085]
module.keycloak_dev.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=de2a665b-a224-420b-ac45-4e6529c40910]
module.keycloak_dev.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=cf16a227-3a88-423b-a540-33dc159b71f7]
module.keycloak_dev.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=8f8f3010-ac19-492e-a56a-102c858c2a9a]
module.keycloak_dev.module.onestopauth.module.client_test-232.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=812c929b-2a36-4515-8347-23b3b02485c3]
module.keycloak_dev.module.onestopauth.module.client_test-232.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=682c10c9-f4d3-4278-84ea-66c919fa4de2]
module.keycloak_dev.module.onestopauth.module.client_test-232.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=d610bd0d-e2f4-48a1-a845-29ea1044e92f]
module.keycloak_dev.module.onestopauth.module.client_test-232.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=3c8cd887-f06a-411f-bec9-039161e03970]
module.keycloak_dev.module.onestopauth.module.client_test-232.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=a849cfea-06c5-4c7a-96d4-b129ed4ef14f]
module.keycloak_dev.module.onestopauth.module.client_test-232.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=fbb0aa2d-e4bb-4df0-8970-77c44a506b46]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=3cafb241-d313-4358-82e6-d869c4709766]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=8025e9f6-2fe6-4037-b4f0-584658f1e2f7]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=958158a6-eb69-4efd-b102-80265d62e24a]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=f98c02aa-f7f3-40fa-a161-ccabeb75dedd]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=234f7f2d-0968-4059-82ed-099e0dd2e3fe]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f8220213-5d69-45ec-ab15-e1070dbf1305]
module.keycloak_dev.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=b1fb3a12-bd49-4b35-90ff-3894904dd0f8]
module.keycloak_dev.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=341d12dd-9534-42eb-9f1b-e97ab0283cf4]
module.keycloak_dev.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=ede2ef2f-0db7-4163-91d9-893300e3a68a]
module.keycloak_dev.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=5cd65f11-28ca-4761-9372-aa0514719b43]
module.keycloak_dev.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=cef6c1e2-d907-4fa7-8168-81c7930f3eb2]
module.keycloak_dev.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=1a95fbf4-d7e6-4510-85ea-1eddf4f7763b]
module.keycloak_dev.module.onestopauth.module.client_aug-18-748-test-diff-email-696.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=5fd22afb-a6ac-45b7-946a-dd3a7968b10b]
module.keycloak_dev.module.onestopauth.module.client_aug-18-748-test-diff-email-696.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=6a19ddf4-b00c-49cd-a5bb-78f610a40849]
module.keycloak_dev.module.onestopauth.module.client_aug-18-748-test-diff-email-696.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=29e7cac3-d053-46d4-a1e3-04ca8a794c31]
module.keycloak_dev.module.onestopauth.module.client_aug-18-748-test-diff-email-696.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=6e424a89-3b3f-40a1-bdec-939cc68006aa]
module.keycloak_dev.module.onestopauth.module.client_aug-18-748-test-diff-email-696.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=56103357-1c26-4df5-9800-3fd1c5a4e130]
module.keycloak_dev.module.onestopauth.module.client_aug-18-748-test-diff-email-696.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=d603ec42-8ab0-4ee8-8bb1-1855a5aa9f4a]
module.keycloak_dev.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=156bc55b-210e-4f01-a713-0e6c11cf0361]
module.keycloak_dev.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=8f0198fb-0455-4811-820c-80e74acf4e7c]
module.keycloak_dev.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=81776136-87a7-49cc-8414-b47235b1ff03]
module.keycloak_dev.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=968ff5f0-ec51-44c6-9fbc-bfa5b12d7710]
module.keycloak_dev.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=7ad5bf86-606e-44c0-b602-e3d26dd378e0]
module.keycloak_dev.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=1ddb02b8-f198-4775-8c88-a72eace09720]
module.keycloak_dev.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=0e86d674-6b15-43ad-9a59-4ed67e5716c1]
module.keycloak_dev.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=2ef72e58-6423-4d3d-b500-5616b969fe5d]
module.keycloak_dev.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=f13c5a82-e594-4403-a728-c6bddd2681ba]
module.keycloak_dev.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=6058e278-c6cb-47dd-881c-4d7c9b2dd1df]
module.keycloak_dev.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=916cc6a4-7729-45e4-a74b-618aaa83d18a]
module.keycloak_dev.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=b0da9850-619f-4388-b419-c35dc71d8646]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth.module.client_https-bcgov-github-io-sso-1521.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_https-bcgov-github-io-sso-1521.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_https-bcgov-github-io-sso-1521.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_https-bcgov-github-io-sso-1521.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "https-bcgov-github-io-sso-1521"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_https-bcgov-github-io-sso-1521.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_https-bcgov-github-io-sso-1521.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_https-bcgov-github-io-sso-1521.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "https-bcgov-github-io-sso-1521"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "https-bcgov-github-io-sso-1521"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://test",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

  # module.keycloak_prod.module.onestopauth.module.client_https-bcgov-github-io-sso-1521.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_https-bcgov-github-io-sso-1521.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_https-bcgov-github-io-sso-1521.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_https-bcgov-github-io-sso-1521.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "https-bcgov-github-io-sso-1521"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_https-bcgov-github-io-sso-1521.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_https-bcgov-github-io-sso-1521.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_https-bcgov-github-io-sso-1521.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "https-bcgov-github-io-sso-1521"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "https-bcgov-github-io-sso-1521"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://test",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

  # module.keycloak_test.module.onestopauth.module.client_https-bcgov-github-io-sso-1521.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_https-bcgov-github-io-sso-1521.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_https-bcgov-github-io-sso-1521.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_https-bcgov-github-io-sso-1521.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "https-bcgov-github-io-sso-1521"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_https-bcgov-github-io-sso-1521.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_https-bcgov-github-io-sso-1521.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_https-bcgov-github-io-sso-1521.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "https-bcgov-github-io-sso-1521"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "https-bcgov-github-io-sso-1521"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://test",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

Plan: 21 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 2009 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*